MikroElektronika/core_packages/PIC/XC8/def/PIC18F65J90/mcu.h
extern volatile LCDDATA7bits_t LCDDATA7bits __at(0xF6D);
// bitfield macros
#define _LCDDATA7_LCDDATA7_POSN                             0x0
#define _LCDDATA7_LCDDATA7_POSITION                         0x0
#define _LCDDATA7_LCDDATA7_SIZE                             0x8
#define _LCDDATA7_LCDDATA7_LENGTH                           0x8
#define _LCDDATA7_LCDDATA7_MASK                             0xFF
#define _LCDDATA7_S8C1_POSN                                 0x0
#define _LCDDATA7_S8C1_POSITION                             0x0
#define _LCDDATA7_S8C1_SIZE                                 0x1
#define _LCDDATA7_S8C1_LENGTH                               0x1
#define _LCDDATA7_S8C1_MASK                                 0x1
#define _LCDDATA7_S9C1_POSN                                 0x1
#define _LCDDATA7_S9C1_POSITION                             0x1
#define _LCDDATA7_S9C1_SIZE                                 0x1
#define _LCDDATA7_S9C1_LENGTH                               0x1
#define _LCDDATA7_S9C1_MASK                                 0x2
#define _LCDDATA7_S10C1_POSN                                0x2
#define _LCDDATA7_S10C1_POSITION                            0x2
#define _LCDDATA7_S10C1_SIZE                                0x1
#define _LCDDATA7_S10C1_LENGTH                              0x1
#define _LCDDATA7_S10C1_MASK                                0x4
#define _LCDDATA7_S11C1_POSN                                0x3
#define _LCDDATA7_S11C1_POSITION                            0x3
#define _LCDDATA7_S11C1_SIZE                                0x1
#define _LCDDATA7_S11C1_LENGTH                              0x1
#define _LCDDATA7_S11C1_MASK                                0x8
#define _LCDDATA7_S12C1_POSN                                0x4
#define _LCDDATA7_S12C1_POSITION                            0x4
#define _LCDDATA7_S12C1_SIZE                                0x1
#define _LCDDATA7_S12C1_LENGTH                              0x1
#define _LCDDATA7_S12C1_MASK                                0x10
#define _LCDDATA7_S13C1_POSN                                0x5
#define _LCDDATA7_S13C1_POSITION                            0x5
#define _LCDDATA7_S13C1_SIZE                                0x1
#define _LCDDATA7_S13C1_LENGTH                              0x1
#define _LCDDATA7_S13C1_MASK                                0x20
#define _LCDDATA7_S14C1_POSN                                0x6
#define _LCDDATA7_S14C1_POSITION                            0x6
#define _LCDDATA7_S14C1_SIZE                                0x1
#define _LCDDATA7_S14C1_LENGTH                              0x1
#define _LCDDATA7_S14C1_MASK                                0x40
#define _LCDDATA7_S15C1_POSN                                0x7
#define _LCDDATA7_S15C1_POSITION                            0x7
#define _LCDDATA7_S15C1_SIZE                                0x1
#define _LCDDATA7_S15C1_LENGTH                              0x1
#define _LCDDATA7_S15C1_MASK                                0x80
#define _LCDDATA7_SEG8COM1_POSN                             0x0
#define _LCDDATA7_SEG8COM1_POSITION                         0x0
#define _LCDDATA7_SEG8COM1_SIZE                             0x1
#define _LCDDATA7_SEG8COM1_LENGTH                           0x1
#define _LCDDATA7_SEG8COM1_MASK                             0x1
#define _LCDDATA7_SEG9COM1_POSN                             0x1
#define _LCDDATA7_SEG9COM1_POSITION                         0x1
#define _LCDDATA7_SEG9COM1_SIZE                             0x1
#define _LCDDATA7_SEG9COM1_LENGTH                           0x1
#define _LCDDATA7_SEG9COM1_MASK                             0x2
#define _LCDDATA7_SEG10COM1_POSN                            0x2
#define _LCDDATA7_SEG10COM1_POSITION                        0x2
#define _LCDDATA7_SEG10COM1_SIZE                            0x1
#define _LCDDATA7_SEG10COM1_LENGTH                          0x1
#define _LCDDATA7_SEG10COM1_MASK                            0x4
#define _LCDDATA7_SEG11COM1_POSN                            0x3
#define _LCDDATA7_SEG11COM1_POSITION                        0x3
#define _LCDDATA7_SEG11COM1_SIZE                            0x1
#define _LCDDATA7_SEG11COM1_LENGTH                          0x1
#define _LCDDATA7_SEG11COM1_MASK                            0x8
#define _LCDDATA7_SEG12COM1_POSN                            0x4
#define _LCDDATA7_SEG12COM1_POSITION                        0x4
#define _LCDDATA7_SEG12COM1_SIZE                            0x1
#define _LCDDATA7_SEG12COM1_LENGTH                          0x1
#define _LCDDATA7_SEG12COM1_MASK                            0x10
#define _LCDDATA7_SEG13COM1_POSN                            0x5
#define _LCDDATA7_SEG13COM1_POSITION                        0x5
#define _LCDDATA7_SEG13COM1_SIZE                            0x1
#define _LCDDATA7_SEG13COM1_LENGTH                          0x1
#define _LCDDATA7_SEG13COM1_MASK                            0x20
#define _LCDDATA7_SEG14COM1_POSN                            0x6
#define _LCDDATA7_SEG14COM1_POSITION                        0x6
#define _LCDDATA7_SEG14COM1_SIZE                            0x1
#define _LCDDATA7_SEG14COM1_LENGTH                          0x1
#define _LCDDATA7_SEG14COM1_MASK                            0x40
#define _LCDDATA7_SEG15COM1_POSN                            0x7
#define _LCDDATA7_SEG15COM1_POSITION                        0x7
#define _LCDDATA7_SEG15COM1_SIZE                            0x1
#define _LCDDATA7_SEG15COM1_LENGTH                          0x1
#define _LCDDATA7_SEG15COM1_MASK                            0x80
#define _LCDDATA7_S08C1_POSN                                0x0
#define _LCDDATA7_S08C1_POSITION                            0x0
#define _LCDDATA7_S08C1_SIZE                                0x1
#define _LCDDATA7_S08C1_LENGTH                              0x1
#define _LCDDATA7_S08C1_MASK                                0x1
#define _LCDDATA7_S09C1_POSN                                0x1
#define _LCDDATA7_S09C1_POSITION                            0x1
#define _LCDDATA7_S09C1_SIZE                                0x1
#define _LCDDATA7_S09C1_LENGTH                              0x1
#define _LCDDATA7_S09C1_MASK                                0x2

// Register: LCDDATA8
#define LCDDATA8 LCDDATA8
extern volatile unsigned char           LCDDATA8            __at(0xF6E);
#ifndef _LIB_BUILD
asm("LCDDATA8 equ 0F6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA8               :8;
    };
    struct {
        unsigned S16C1                  :1;
        unsigned S17C1                  :1;
        unsigned S18C1                  :1;
        unsigned S19C1                  :1;
        unsigned S20C1                  :1;
        unsigned S21C1                  :1;
        unsigned S22C1                  :1;
        unsigned S23C1                  :1;
    };
    struct {
        unsigned SEG16COM1              :1;
        unsigned SEG17COM1              :1;
        unsigned SEG18COM1              :1;
        unsigned SEG19COM1              :1;
        unsigned SEG20COM1              :1;
        unsigned SEG21COM1              :1;
        unsigned SEG22COM1              :1;
        unsigned SEG23COM1              :1;
    };
} LCDDATA8bits_t;
extern volatile LCDDATA8bits_t LCDDATA8bits __at(0xF6E);
// bitfield macros
#define _LCDDATA8_LCDDATA8_POSN                             0x0
#define _LCDDATA8_LCDDATA8_POSITION                         0x0
#define _LCDDATA8_LCDDATA8_SIZE                             0x8
#define _LCDDATA8_LCDDATA8_LENGTH                           0x8
#define _LCDDATA8_LCDDATA8_MASK                             0xFF
#define _LCDDATA8_S16C1_POSN                                0x0
#define _LCDDATA8_S16C1_POSITION                            0x0
#define _LCDDATA8_S16C1_SIZE                                0x1
#define _LCDDATA8_S16C1_LENGTH                              0x1
#define _LCDDATA8_S16C1_MASK                                0x1
#define _LCDDATA8_S17C1_POSN                                0x1
#define _LCDDATA8_S17C1_POSITION                            0x1
#define _LCDDATA8_S17C1_SIZE                                0x1
#define _LCDDATA8_S17C1_LENGTH                              0x1
#define _LCDDATA8_S17C1_MASK                                0x2
#define _LCDDATA8_S18C1_POSN                                0x2
#define _LCDDATA8_S18C1_POSITION                            0x2
#define _LCDDATA8_S18C1_SIZE                                0x1
#define _LCDDATA8_S18C1_LENGTH                              0x1
#define _LCDDATA8_S18C1_MASK                                0x4
#define _LCDDATA8_S19C1_POSN                                0x3
#define _LCDDATA8_S19C1_POSITION                            0x3
#define _LCDDATA8_S19C1_SIZE                                0x1
#define _LCDDATA8_S19C1_LENGTH                              0x1
#define _LCDDATA8_S19C1_MASK                                0x8
#define _LCDDATA8_S20C1_POSN                                0x4
#define _LCDDATA8_S20C1_POSITION                            0x4
#define _LCDDATA8_S20C1_SIZE                                0x1
#define _LCDDATA8_S20C1_LENGTH                              0x1
#define _LCDDATA8_S20C1_MASK                                0x10
#define _LCDDATA8_S21C1_POSN                                0x5
#define _LCDDATA8_S21C1_POSITION                            0x5
#define _LCDDATA8_S21C1_SIZE                                0x1
#define _LCDDATA8_S21C1_LENGTH                              0x1
#define _LCDDATA8_S21C1_MASK                                0x20
#define _LCDDATA8_S22C1_POSN                                0x6
#define _LCDDATA8_S22C1_POSITION                            0x6
#define _LCDDATA8_S22C1_SIZE                                0x1
#define _LCDDATA8_S22C1_LENGTH                              0x1
#define _LCDDATA8_S22C1_MASK                                0x40
#define _LCDDATA8_S23C1_POSN                                0x7
#define _LCDDATA8_S23C1_POSITION                            0x7
#define _LCDDATA8_S23C1_SIZE                                0x1
#define _LCDDATA8_S23C1_LENGTH                              0x1
#define _LCDDATA8_S23C1_MASK                                0x80
#define _LCDDATA8_SEG16COM1_POSN                            0x0
#define _LCDDATA8_SEG16COM1_POSITION                        0x0
#define _LCDDATA8_SEG16COM1_SIZE                            0x1
#define _LCDDATA8_SEG16COM1_LENGTH                          0x1
#define _LCDDATA8_SEG16COM1_MASK                            0x1
#define _LCDDATA8_SEG17COM1_POSN                            0x1
#define _LCDDATA8_SEG17COM1_POSITION                        0x1
#define _LCDDATA8_SEG17COM1_SIZE                            0x1
#define _LCDDATA8_SEG17COM1_LENGTH                          0x1
#define _LCDDATA8_SEG17COM1_MASK                            0x2
#define _LCDDATA8_SEG18COM1_POSN                            0x2
#define _LCDDATA8_SEG18COM1_POSITION                        0x2
#define _LCDDATA8_SEG18COM1_SIZE                            0x1
#define _LCDDATA8_SEG18COM1_LENGTH                          0x1
#define _LCDDATA8_SEG18COM1_MASK                            0x4
#define _LCDDATA8_SEG19COM1_POSN                            0x3
#define _LCDDATA8_SEG19COM1_POSITION                        0x3
#define _LCDDATA8_SEG19COM1_SIZE                            0x1
#define _LCDDATA8_SEG19COM1_LENGTH                          0x1
#define _LCDDATA8_SEG19COM1_MASK                            0x8
#define _LCDDATA8_SEG20COM1_POSN                            0x4
#define _LCDDATA8_SEG20COM1_POSITION                        0x4
#define _LCDDATA8_SEG20COM1_SIZE                            0x1
#define _LCDDATA8_SEG20COM1_LENGTH                          0x1
#define _LCDDATA8_SEG20COM1_MASK                            0x10
#define _LCDDATA8_SEG21COM1_POSN                            0x5
#define _LCDDATA8_SEG21COM1_POSITION                        0x5
#define _LCDDATA8_SEG21COM1_SIZE                            0x1
#define _LCDDATA8_SEG21COM1_LENGTH                          0x1
#define _LCDDATA8_SEG21COM1_MASK                            0x20
#define _LCDDATA8_SEG22COM1_POSN                            0x6
#define _LCDDATA8_SEG22COM1_POSITION                        0x6
#define _LCDDATA8_SEG22COM1_SIZE                            0x1
#define _LCDDATA8_SEG22COM1_LENGTH                          0x1
#define _LCDDATA8_SEG22COM1_MASK                            0x40
#define _LCDDATA8_SEG23COM1_POSN                            0x7
#define _LCDDATA8_SEG23COM1_POSITION                        0x7
#define _LCDDATA8_SEG23COM1_SIZE                            0x1
#define _LCDDATA8_SEG23COM1_LENGTH                          0x1
#define _LCDDATA8_SEG23COM1_MASK                            0x80

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
extern volatile unsigned char           LCDDATA9            __at(0xF6F);
#ifndef _LIB_BUILD
asm("LCDDATA9 equ 0F6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA9               :8;
    };
    struct {
        unsigned S24C1                  :1;
        unsigned S25C1                  :1;
        unsigned S26C1                  :1;
        unsigned S27C1                  :1;
        unsigned S28C1                  :1;
        unsigned S29C1                  :1;
        unsigned S30C1                  :1;
        unsigned S31C1                  :1;
    };
    struct {
        unsigned SEG24COM1              :1;
        unsigned SEG25COM1              :1;
        unsigned SEG26COM1              :1;
        unsigned SEG27COM1              :1;
        unsigned SEG28COM1              :1;
        unsigned SEG29COM1              :1;
        unsigned SEG30COM1              :1;
        unsigned SEG31COM1              :1;
    };
} LCDDATA9bits_t;
