MikroElektronika/core_packages/PIC/XC8/def/PIC18F65J90/mcu.h
// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
extern volatile unsigned char           LCDDATA15           __at(0xF75);
#ifndef _LIB_BUILD
asm("LCDDATA15 equ 0F75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA15              :8;
    };
    struct {
        unsigned S24C2                  :1;
        unsigned S25C2                  :1;
        unsigned S26C2                  :1;
        unsigned S27C2                  :1;
        unsigned S28C2                  :1;
        unsigned S29C2                  :1;
        unsigned S30C2                  :1;
        unsigned S31C2                  :1;
    };
    struct {
        unsigned SEG24COM2              :1;
        unsigned SEG25COM2              :1;
        unsigned SEG26COM2              :1;
        unsigned SEG27COM2              :1;
        unsigned SEG28COM2              :1;
        unsigned SEG29COM2              :1;
        unsigned SEG30COM2              :1;
        unsigned SEG31COM2              :1;
    };
} LCDDATA15bits_t;
extern volatile LCDDATA15bits_t LCDDATA15bits __at(0xF75);
// bitfield macros
#define _LCDDATA15_LCDDATA15_POSN                           0x0
#define _LCDDATA15_LCDDATA15_POSITION                       0x0
#define _LCDDATA15_LCDDATA15_SIZE                           0x8
#define _LCDDATA15_LCDDATA15_LENGTH                         0x8
#define _LCDDATA15_LCDDATA15_MASK                           0xFF
#define _LCDDATA15_S24C2_POSN                               0x0
#define _LCDDATA15_S24C2_POSITION                           0x0
#define _LCDDATA15_S24C2_SIZE                               0x1
#define _LCDDATA15_S24C2_LENGTH                             0x1
#define _LCDDATA15_S24C2_MASK                               0x1
#define _LCDDATA15_S25C2_POSN                               0x1
#define _LCDDATA15_S25C2_POSITION                           0x1
#define _LCDDATA15_S25C2_SIZE                               0x1
#define _LCDDATA15_S25C2_LENGTH                             0x1
#define _LCDDATA15_S25C2_MASK                               0x2
#define _LCDDATA15_S26C2_POSN                               0x2
#define _LCDDATA15_S26C2_POSITION                           0x2
#define _LCDDATA15_S26C2_SIZE                               0x1
#define _LCDDATA15_S26C2_LENGTH                             0x1
#define _LCDDATA15_S26C2_MASK                               0x4
#define _LCDDATA15_S27C2_POSN                               0x3
#define _LCDDATA15_S27C2_POSITION                           0x3
#define _LCDDATA15_S27C2_SIZE                               0x1
#define _LCDDATA15_S27C2_LENGTH                             0x1
#define _LCDDATA15_S27C2_MASK                               0x8
#define _LCDDATA15_S28C2_POSN                               0x4
#define _LCDDATA15_S28C2_POSITION                           0x4
#define _LCDDATA15_S28C2_SIZE                               0x1
#define _LCDDATA15_S28C2_LENGTH                             0x1
#define _LCDDATA15_S28C2_MASK                               0x10
#define _LCDDATA15_S29C2_POSN                               0x5
#define _LCDDATA15_S29C2_POSITION                           0x5
#define _LCDDATA15_S29C2_SIZE                               0x1
#define _LCDDATA15_S29C2_LENGTH                             0x1
#define _LCDDATA15_S29C2_MASK                               0x20
#define _LCDDATA15_S30C2_POSN                               0x6
#define _LCDDATA15_S30C2_POSITION                           0x6
#define _LCDDATA15_S30C2_SIZE                               0x1
#define _LCDDATA15_S30C2_LENGTH                             0x1
#define _LCDDATA15_S30C2_MASK                               0x40
#define _LCDDATA15_S31C2_POSN                               0x7
#define _LCDDATA15_S31C2_POSITION                           0x7
#define _LCDDATA15_S31C2_SIZE                               0x1
#define _LCDDATA15_S31C2_LENGTH                             0x1
#define _LCDDATA15_S31C2_MASK                               0x80
#define _LCDDATA15_SEG24COM2_POSN                           0x0
#define _LCDDATA15_SEG24COM2_POSITION                       0x0
#define _LCDDATA15_SEG24COM2_SIZE                           0x1
#define _LCDDATA15_SEG24COM2_LENGTH                         0x1
#define _LCDDATA15_SEG24COM2_MASK                           0x1
#define _LCDDATA15_SEG25COM2_POSN                           0x1
#define _LCDDATA15_SEG25COM2_POSITION                       0x1
#define _LCDDATA15_SEG25COM2_SIZE                           0x1
#define _LCDDATA15_SEG25COM2_LENGTH                         0x1
#define _LCDDATA15_SEG25COM2_MASK                           0x2
#define _LCDDATA15_SEG26COM2_POSN                           0x2
#define _LCDDATA15_SEG26COM2_POSITION                       0x2
#define _LCDDATA15_SEG26COM2_SIZE                           0x1
#define _LCDDATA15_SEG26COM2_LENGTH                         0x1
#define _LCDDATA15_SEG26COM2_MASK                           0x4
#define _LCDDATA15_SEG27COM2_POSN                           0x3
#define _LCDDATA15_SEG27COM2_POSITION                       0x3
#define _LCDDATA15_SEG27COM2_SIZE                           0x1
#define _LCDDATA15_SEG27COM2_LENGTH                         0x1
#define _LCDDATA15_SEG27COM2_MASK                           0x8
#define _LCDDATA15_SEG28COM2_POSN                           0x4
#define _LCDDATA15_SEG28COM2_POSITION                       0x4
#define _LCDDATA15_SEG28COM2_SIZE                           0x1
#define _LCDDATA15_SEG28COM2_LENGTH                         0x1
#define _LCDDATA15_SEG28COM2_MASK                           0x10
#define _LCDDATA15_SEG29COM2_POSN                           0x5
#define _LCDDATA15_SEG29COM2_POSITION                       0x5
#define _LCDDATA15_SEG29COM2_SIZE                           0x1
#define _LCDDATA15_SEG29COM2_LENGTH                         0x1
#define _LCDDATA15_SEG29COM2_MASK                           0x20
#define _LCDDATA15_SEG30COM2_POSN                           0x6
#define _LCDDATA15_SEG30COM2_POSITION                       0x6
#define _LCDDATA15_SEG30COM2_SIZE                           0x1
#define _LCDDATA15_SEG30COM2_LENGTH                         0x1
#define _LCDDATA15_SEG30COM2_MASK                           0x40
#define _LCDDATA15_SEG31COM2_POSN                           0x7
#define _LCDDATA15_SEG31COM2_POSITION                       0x7
#define _LCDDATA15_SEG31COM2_SIZE                           0x1
#define _LCDDATA15_SEG31COM2_LENGTH                         0x1
#define _LCDDATA15_SEG31COM2_MASK                           0x80

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
extern volatile unsigned char           LCDDATA16           __at(0xF76);
#ifndef _LIB_BUILD
asm("LCDDATA16 equ 0F76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA16              :8;
    };
    struct {
        unsigned S32C2                  :1;
    };
    struct {
        unsigned SEG32COM2              :1;
    };
    struct {
        unsigned T4CKPS016              :1;
        unsigned T4CKPS116              :1;
        unsigned                        :1;
        unsigned T4OUTPS016             :1;
        unsigned T4OUTPS116             :1;
        unsigned T4OUTPS216             :1;
        unsigned T4OUTPS316             :1;
    };
} LCDDATA16bits_t;
extern volatile LCDDATA16bits_t LCDDATA16bits __at(0xF76);
// bitfield macros
#define _LCDDATA16_LCDDATA16_POSN                           0x0
#define _LCDDATA16_LCDDATA16_POSITION                       0x0
#define _LCDDATA16_LCDDATA16_SIZE                           0x8
#define _LCDDATA16_LCDDATA16_LENGTH                         0x8
#define _LCDDATA16_LCDDATA16_MASK                           0xFF
#define _LCDDATA16_S32C2_POSN                               0x0
#define _LCDDATA16_S32C2_POSITION                           0x0
#define _LCDDATA16_S32C2_SIZE                               0x1
#define _LCDDATA16_S32C2_LENGTH                             0x1
#define _LCDDATA16_S32C2_MASK                               0x1
#define _LCDDATA16_SEG32COM2_POSN                           0x0
#define _LCDDATA16_SEG32COM2_POSITION                       0x0
#define _LCDDATA16_SEG32COM2_SIZE                           0x1
#define _LCDDATA16_SEG32COM2_LENGTH                         0x1
#define _LCDDATA16_SEG32COM2_MASK                           0x1
#define _LCDDATA16_T4CKPS016_POSN                           0x0
#define _LCDDATA16_T4CKPS016_POSITION                       0x0
#define _LCDDATA16_T4CKPS016_SIZE                           0x1
#define _LCDDATA16_T4CKPS016_LENGTH                         0x1
#define _LCDDATA16_T4CKPS016_MASK                           0x1
#define _LCDDATA16_T4CKPS116_POSN                           0x1
#define _LCDDATA16_T4CKPS116_POSITION                       0x1
#define _LCDDATA16_T4CKPS116_SIZE                           0x1
#define _LCDDATA16_T4CKPS116_LENGTH                         0x1
#define _LCDDATA16_T4CKPS116_MASK                           0x2
#define _LCDDATA16_T4OUTPS016_POSN                          0x3
#define _LCDDATA16_T4OUTPS016_POSITION                      0x3
#define _LCDDATA16_T4OUTPS016_SIZE                          0x1
#define _LCDDATA16_T4OUTPS016_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS016_MASK                          0x8
#define _LCDDATA16_T4OUTPS116_POSN                          0x4
#define _LCDDATA16_T4OUTPS116_POSITION                      0x4
#define _LCDDATA16_T4OUTPS116_SIZE                          0x1
#define _LCDDATA16_T4OUTPS116_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS116_MASK                          0x10
#define _LCDDATA16_T4OUTPS216_POSN                          0x5
#define _LCDDATA16_T4OUTPS216_POSITION                      0x5
#define _LCDDATA16_T4OUTPS216_SIZE                          0x1
#define _LCDDATA16_T4OUTPS216_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS216_MASK                          0x20
#define _LCDDATA16_T4OUTPS316_POSN                          0x6
#define _LCDDATA16_T4OUTPS316_POSITION                      0x6
#define _LCDDATA16_T4OUTPS316_SIZE                          0x1
#define _LCDDATA16_T4OUTPS316_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS316_MASK                          0x40

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
extern volatile unsigned char           LCDDATA18           __at(0xF78);
#ifndef _LIB_BUILD
asm("LCDDATA18 equ 0F78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA18              :8;
    };
    struct {
        unsigned S00C3                  :1;
        unsigned S01C3                  :1;
        unsigned S02C3                  :1;
        unsigned S03C3                  :1;
        unsigned S04C3                  :1;
        unsigned S05C3                  :1;
        unsigned S06C3                  :1;
        unsigned S07C3                  :1;
    };
    struct {
        unsigned SEG0COM3               :1;
        unsigned SEG1COM3               :1;
        unsigned SEG2COM3               :1;
        unsigned SEG3COM3               :1;
        unsigned SEG4COM3               :1;
        unsigned SEG5COM3               :1;
        unsigned SEG6COM3               :1;
        unsigned SEG7COM3               :1;
    };
    struct {
        unsigned S0C3                   :1;
        unsigned S1C3                   :1;
        unsigned S2C3                   :1;
        unsigned S3C3                   :1;
        unsigned S4C3                   :1;
        unsigned S5C3                   :1;
        unsigned S6C3                   :1;
        unsigned S7C3                   :1;
    };
} LCDDATA18bits_t;
extern volatile LCDDATA18bits_t LCDDATA18bits __at(0xF78);
// bitfield macros
#define _LCDDATA18_LCDDATA18_POSN                           0x0
#define _LCDDATA18_LCDDATA18_POSITION                       0x0
#define _LCDDATA18_LCDDATA18_SIZE                           0x8
#define _LCDDATA18_LCDDATA18_LENGTH                         0x8
#define _LCDDATA18_LCDDATA18_MASK                           0xFF
#define _LCDDATA18_S00C3_POSN                               0x0
#define _LCDDATA18_S00C3_POSITION                           0x0
#define _LCDDATA18_S00C3_SIZE                               0x1
#define _LCDDATA18_S00C3_LENGTH                             0x1
#define _LCDDATA18_S00C3_MASK                               0x1
#define _LCDDATA18_S01C3_POSN                               0x1
#define _LCDDATA18_S01C3_POSITION                           0x1
#define _LCDDATA18_S01C3_SIZE                               0x1
#define _LCDDATA18_S01C3_LENGTH                             0x1
#define _LCDDATA18_S01C3_MASK                               0x2
#define _LCDDATA18_S02C3_POSN                               0x2
#define _LCDDATA18_S02C3_POSITION                           0x2
#define _LCDDATA18_S02C3_SIZE                               0x1
#define _LCDDATA18_S02C3_LENGTH                             0x1
#define _LCDDATA18_S02C3_MASK                               0x4
#define _LCDDATA18_S03C3_POSN                               0x3
#define _LCDDATA18_S03C3_POSITION                           0x3
#define _LCDDATA18_S03C3_SIZE                               0x1
#define _LCDDATA18_S03C3_LENGTH                             0x1
#define _LCDDATA18_S03C3_MASK                               0x8
#define _LCDDATA18_S04C3_POSN                               0x4
#define _LCDDATA18_S04C3_POSITION                           0x4
#define _LCDDATA18_S04C3_SIZE                               0x1
#define _LCDDATA18_S04C3_LENGTH                             0x1
#define _LCDDATA18_S04C3_MASK                               0x10
#define _LCDDATA18_S05C3_POSN                               0x5
#define _LCDDATA18_S05C3_POSITION                           0x5
#define _LCDDATA18_S05C3_SIZE                               0x1
#define _LCDDATA18_S05C3_LENGTH                             0x1
#define _LCDDATA18_S05C3_MASK                               0x20
#define _LCDDATA18_S06C3_POSN                               0x6
#define _LCDDATA18_S06C3_POSITION                           0x6
#define _LCDDATA18_S06C3_SIZE                               0x1
#define _LCDDATA18_S06C3_LENGTH                             0x1
#define _LCDDATA18_S06C3_MASK                               0x40
#define _LCDDATA18_S07C3_POSN                               0x7
#define _LCDDATA18_S07C3_POSITION                           0x7
#define _LCDDATA18_S07C3_SIZE                               0x1
#define _LCDDATA18_S07C3_LENGTH                             0x1
#define _LCDDATA18_S07C3_MASK                               0x80
#define _LCDDATA18_SEG0COM3_POSN                            0x0
#define _LCDDATA18_SEG0COM3_POSITION                        0x0
#define _LCDDATA18_SEG0COM3_SIZE                            0x1
#define _LCDDATA18_SEG0COM3_LENGTH                          0x1
#define _LCDDATA18_SEG0COM3_MASK                            0x1
#define _LCDDATA18_SEG1COM3_POSN                            0x1
#define _LCDDATA18_SEG1COM3_POSITION                        0x1
#define _LCDDATA18_SEG1COM3_SIZE                            0x1
#define _LCDDATA18_SEG1COM3_LENGTH                          0x1
#define _LCDDATA18_SEG1COM3_MASK                            0x2
#define _LCDDATA18_SEG2COM3_POSN                            0x2
#define _LCDDATA18_SEG2COM3_POSITION                        0x2
#define _LCDDATA18_SEG2COM3_SIZE                            0x1
#define _LCDDATA18_SEG2COM3_LENGTH                          0x1
#define _LCDDATA18_SEG2COM3_MASK                            0x4
#define _LCDDATA18_SEG3COM3_POSN                            0x3
#define _LCDDATA18_SEG3COM3_POSITION                        0x3
#define _LCDDATA18_SEG3COM3_SIZE                            0x1
#define _LCDDATA18_SEG3COM3_LENGTH                          0x1
#define _LCDDATA18_SEG3COM3_MASK                            0x8
#define _LCDDATA18_SEG4COM3_POSN                            0x4
#define _LCDDATA18_SEG4COM3_POSITION                        0x4
#define _LCDDATA18_SEG4COM3_SIZE                            0x1
#define _LCDDATA18_SEG4COM3_LENGTH                          0x1
#define _LCDDATA18_SEG4COM3_MASK                            0x10
#define _LCDDATA18_SEG5COM3_POSN                            0x5
#define _LCDDATA18_SEG5COM3_POSITION                        0x5
#define _LCDDATA18_SEG5COM3_SIZE                            0x1
#define _LCDDATA18_SEG5COM3_LENGTH                          0x1
#define _LCDDATA18_SEG5COM3_MASK                            0x20
#define _LCDDATA18_SEG6COM3_POSN                            0x6
#define _LCDDATA18_SEG6COM3_POSITION                        0x6
#define _LCDDATA18_SEG6COM3_SIZE                            0x1
#define _LCDDATA18_SEG6COM3_LENGTH                          0x1
#define _LCDDATA18_SEG6COM3_MASK                            0x40
#define _LCDDATA18_SEG7COM3_POSN                            0x7
#define _LCDDATA18_SEG7COM3_POSITION                        0x7
#define _LCDDATA18_SEG7COM3_SIZE                            0x1
#define _LCDDATA18_SEG7COM3_LENGTH                          0x1
#define _LCDDATA18_SEG7COM3_MASK                            0x80
#define _LCDDATA18_S0C3_POSN                                0x0
#define _LCDDATA18_S0C3_POSITION                            0x0
#define _LCDDATA18_S0C3_SIZE                                0x1
#define _LCDDATA18_S0C3_LENGTH                              0x1
#define _LCDDATA18_S0C3_MASK                                0x1
#define _LCDDATA18_S1C3_POSN                                0x1
#define _LCDDATA18_S1C3_POSITION                            0x1
#define _LCDDATA18_S1C3_SIZE                                0x1
#define _LCDDATA18_S1C3_LENGTH                              0x1
#define _LCDDATA18_S1C3_MASK                                0x2
#define _LCDDATA18_S2C3_POSN                                0x2
#define _LCDDATA18_S2C3_POSITION                            0x2
#define _LCDDATA18_S2C3_SIZE                                0x1
#define _LCDDATA18_S2C3_LENGTH                              0x1
#define _LCDDATA18_S2C3_MASK                                0x4
#define _LCDDATA18_S3C3_POSN                                0x3
#define _LCDDATA18_S3C3_POSITION                            0x3
#define _LCDDATA18_S3C3_SIZE                                0x1
#define _LCDDATA18_S3C3_LENGTH                              0x1
#define _LCDDATA18_S3C3_MASK                                0x8
#define _LCDDATA18_S4C3_POSN                                0x4
#define _LCDDATA18_S4C3_POSITION                            0x4
#define _LCDDATA18_S4C3_SIZE                                0x1
#define _LCDDATA18_S4C3_LENGTH                              0x1
#define _LCDDATA18_S4C3_MASK                                0x10
#define _LCDDATA18_S5C3_POSN                                0x5
#define _LCDDATA18_S5C3_POSITION                            0x5
#define _LCDDATA18_S5C3_SIZE                                0x1
#define _LCDDATA18_S5C3_LENGTH                              0x1
#define _LCDDATA18_S5C3_MASK                                0x20
#define _LCDDATA18_S6C3_POSN                                0x6
#define _LCDDATA18_S6C3_POSITION                            0x6
#define _LCDDATA18_S6C3_SIZE                                0x1
#define _LCDDATA18_S6C3_LENGTH                              0x1
#define _LCDDATA18_S6C3_MASK                                0x40
#define _LCDDATA18_S7C3_POSN                                0x7
#define _LCDDATA18_S7C3_POSITION                            0x7
#define _LCDDATA18_S7C3_SIZE                                0x1
#define _LCDDATA18_S7C3_LENGTH                              0x1
#define _LCDDATA18_S7C3_MASK                                0x80

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
extern volatile unsigned char           LCDDATA19           __at(0xF79);
#ifndef _LIB_BUILD
asm("LCDDATA19 equ 0F79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA19              :8;
    };
    struct {
        unsigned S8C3                   :1;
        unsigned S9C3                   :1;
        unsigned S10C3                  :1;
        unsigned S11C3                  :1;
        unsigned S12C3                  :1;
        unsigned S13C3                  :1;
        unsigned S14C3                  :1;
        unsigned S15C3                  :1;
    };
    struct {
        unsigned SEG8COM3               :1;
        unsigned SEG9COM3               :1;
        unsigned SEG10COM3              :1;
        unsigned SEG11COM3              :1;
        unsigned SEG12COM3              :1;
        unsigned SEG13COM3              :1;
        unsigned SEG14COM3              :1;
        unsigned SEG15COM3              :1;
    };
    struct {
        unsigned S08C3                  :1;
        unsigned S09C3                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned T3CKPS019              :1;
        unsigned T3CKPS119              :1;
        unsigned TMR3CS019              :1;
        unsigned TMR3CS119              :1;
    };
} LCDDATA19bits_t;
