MikroElektronika/core_packages/PIC/XC8/def/PIC18F65J90/mcu.h
extern volatile __bit                   SE32                __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 SE32_bit            _BIT_ACCESS(LCDSE4,0)
// LCDSE0<SE4>
extern volatile __bit                   SE4                 __at(0x7D4C);	// @ (0xFA9 * 8 + 4)
#define                                 SE4_bit             _BIT_ACCESS(LCDSE0,4)
// LCDSE0<SE5>
extern volatile __bit                   SE5                 __at(0x7D4D);	// @ (0xFA9 * 8 + 5)
#define                                 SE5_bit             _BIT_ACCESS(LCDSE0,5)
// LCDSE0<SE6>
extern volatile __bit                   SE6                 __at(0x7D4E);	// @ (0xFA9 * 8 + 6)
#define                                 SE6_bit             _BIT_ACCESS(LCDSE0,6)
// LCDSE0<SE7>
extern volatile __bit                   SE7                 __at(0x7D4F);	// @ (0xFA9 * 8 + 7)
#define                                 SE7_bit             _BIT_ACCESS(LCDSE0,7)
// LCDSE1<SE8>
extern volatile __bit                   SE8                 __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 SE8_bit             _BIT_ACCESS(LCDSE1,0)
// LCDSE1<SE9>
extern volatile __bit                   SE9                 __at(0x7DB1);	// @ (0xFB6 * 8 + 1)
#define                                 SE9_bit             _BIT_ACCESS(LCDSE1,1)
// PORTD<SEG0>
extern volatile __bit                   SEG0                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 SEG0_bit            _BIT_ACCESS(PORTD,0)
// LCDDATA0<SEG0COM0>
extern volatile __bit                   SEG0COM0            __at(0x7DD8);	// @ (0xFBB * 8 + 0)
#define                                 SEG0COM0_bit        _BIT_ACCESS(LCDDATA0,0)
// LCDDATA6<SEG0COM1>
extern volatile __bit                   SEG0COM1            __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 SEG0COM1_bit        _BIT_ACCESS(LCDDATA6,0)
// LCDDATA12<SEG0COM2>
extern volatile __bit                   SEG0COM2            __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 SEG0COM2_bit        _BIT_ACCESS(LCDDATA12,0)
// LCDDATA18<SEG0COM3>
extern volatile __bit                   SEG0COM3            __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 SEG0COM3_bit        _BIT_ACCESS(LCDDATA18,0)
// PORTD<SEG1>
extern volatile __bit                   SEG1                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 SEG1_bit            _BIT_ACCESS(PORTD,1)
// PORTB<SEG10>
extern volatile __bit                   SEG10               __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 SEG10_bit           _BIT_ACCESS(PORTB,3)
// LCDDATA1<SEG10COM0>
extern volatile __bit                   SEG10COM0           __at(0x7DE2);	// @ (0xFBC * 8 + 2)
#define                                 SEG10COM0_bit       _BIT_ACCESS(LCDDATA1,2)
// LCDDATA7<SEG10COM1>
extern volatile __bit                   SEG10COM1           __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 SEG10COM1_bit       _BIT_ACCESS(LCDDATA7,2)
// LCDDATA13<SEG10COM2>
extern volatile __bit                   SEG10COM2           __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 SEG10COM2_bit       _BIT_ACCESS(LCDDATA13,2)
// LCDDATA19<SEG10COM3>
extern volatile __bit                   SEG10COM3           __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 SEG10COM3_bit       _BIT_ACCESS(LCDDATA19,2)
// PORTB<SEG11>
extern volatile __bit                   SEG11               __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 SEG11_bit           _BIT_ACCESS(PORTB,4)
// LCDDATA1<SEG11COM0>
extern volatile __bit                   SEG11COM0           __at(0x7DE3);	// @ (0xFBC * 8 + 3)
#define                                 SEG11COM0_bit       _BIT_ACCESS(LCDDATA1,3)
// LCDDATA7<SEG11COM1>
extern volatile __bit                   SEG11COM1           __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 SEG11COM1_bit       _BIT_ACCESS(LCDDATA7,3)
// LCDDATA13<SEG11COM2>
extern volatile __bit                   SEG11COM2           __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 SEG11COM2_bit       _BIT_ACCESS(LCDDATA13,3)
// LCDDATA19<SEG11COM3>
extern volatile __bit                   SEG11COM3           __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 SEG11COM3_bit       _BIT_ACCESS(LCDDATA19,3)
// PORTC<SEG12>
extern volatile __bit                   SEG12               __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SEG12_bit           _BIT_ACCESS(PORTC,5)
// LCDDATA1<SEG12COM0>
extern volatile __bit                   SEG12COM0           __at(0x7DE4);	// @ (0xFBC * 8 + 4)
#define                                 SEG12COM0_bit       _BIT_ACCESS(LCDDATA1,4)
// LCDDATA7<SEG12COM1>
extern volatile __bit                   SEG12COM1           __at(0x7B6C);	// @ (0xF6D * 8 + 4)
#define                                 SEG12COM1_bit       _BIT_ACCESS(LCDDATA7,4)
// LCDDATA13<SEG12COM2>
extern volatile __bit                   SEG12COM2           __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 SEG12COM2_bit       _BIT_ACCESS(LCDDATA13,4)
// LCDDATA19<SEG12COM3>
extern volatile __bit                   SEG12COM3           __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 SEG12COM3_bit       _BIT_ACCESS(LCDDATA19,4)
// PORTC<SEG13>
extern volatile __bit                   SEG13               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 SEG13_bit           _BIT_ACCESS(PORTC,2)
// LCDDATA1<SEG13COM0>
extern volatile __bit                   SEG13COM0           __at(0x7DE5);	// @ (0xFBC * 8 + 5)
#define                                 SEG13COM0_bit       _BIT_ACCESS(LCDDATA1,5)
// LCDDATA7<SEG13COM1>
extern volatile __bit                   SEG13COM1           __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 SEG13COM1_bit       _BIT_ACCESS(LCDDATA7,5)
// LCDDATA13<SEG13COM2>
extern volatile __bit                   SEG13COM2           __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 SEG13COM2_bit       _BIT_ACCESS(LCDDATA13,5)
// LCDDATA19<SEG13COM3>
extern volatile __bit                   SEG13COM3           __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 SEG13COM3_bit       _BIT_ACCESS(LCDDATA19,5)
// PORTA<SEG14>
extern volatile __bit                   SEG14               __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 SEG14_bit           _BIT_ACCESS(PORTA,4)
// LCDDATA1<SEG14COM0>
extern volatile __bit                   SEG14COM0           __at(0x7DE6);	// @ (0xFBC * 8 + 6)
#define                                 SEG14COM0_bit       _BIT_ACCESS(LCDDATA1,6)
// LCDDATA7<SEG14COM1>
extern volatile __bit                   SEG14COM1           __at(0x7B6E);	// @ (0xF6D * 8 + 6)
#define                                 SEG14COM1_bit       _BIT_ACCESS(LCDDATA7,6)
// LCDDATA13<SEG14COM2>
extern volatile __bit                   SEG14COM2           __at(0x7B9E);	// @ (0xF73 * 8 + 6)
#define                                 SEG14COM2_bit       _BIT_ACCESS(LCDDATA13,6)
// LCDDATA19<SEG14COM3>
extern volatile __bit                   SEG14COM3           __at(0x7BCE);	// @ (0xF79 * 8 + 6)
#define                                 SEG14COM3_bit       _BIT_ACCESS(LCDDATA19,6)
// PORTA<SEG15>
extern volatile __bit                   SEG15               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 SEG15_bit           _BIT_ACCESS(PORTA,5)
// LCDDATA1<SEG15COM0>
extern volatile __bit                   SEG15COM0           __at(0x7DE7);	// @ (0xFBC * 8 + 7)
#define                                 SEG15COM0_bit       _BIT_ACCESS(LCDDATA1,7)
// LCDDATA7<SEG15COM1>
extern volatile __bit                   SEG15COM1           __at(0x7B6F);	// @ (0xF6D * 8 + 7)
#define                                 SEG15COM1_bit       _BIT_ACCESS(LCDDATA7,7)
// LCDDATA13<SEG15COM2>
extern volatile __bit                   SEG15COM2           __at(0x7B9F);	// @ (0xF73 * 8 + 7)
#define                                 SEG15COM2_bit       _BIT_ACCESS(LCDDATA13,7)
// LCDDATA19<SEG15COM3>
extern volatile __bit                   SEG15COM3           __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 SEG15COM3_bit       _BIT_ACCESS(LCDDATA19,7)
// PORTC<SEG16>
extern volatile __bit                   SEG16               __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SEG16_bit           _BIT_ACCESS(PORTC,4)
// LCDDATA2<SEG16COM0>
extern volatile __bit                   SEG16COM0           __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 SEG16COM0_bit       _BIT_ACCESS(LCDDATA2,0)
// LCDDATA8<SEG16COM1>
extern volatile __bit                   SEG16COM1           __at(0x7B70);	// @ (0xF6E * 8 + 0)
#define                                 SEG16COM1_bit       _BIT_ACCESS(LCDDATA8,0)
// LCDDATA14<SEG16COM2>
extern volatile __bit                   SEG16COM2           __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 SEG16COM2_bit       _BIT_ACCESS(LCDDATA14,0)
// LCDDATA20<SEG16COM3>
extern volatile __bit                   SEG16COM3           __at(0x7BD0);	// @ (0xF7A * 8 + 0)
#define                                 SEG16COM3_bit       _BIT_ACCESS(LCDDATA20,0)
// PORTC<SEG17>
extern volatile __bit                   SEG17               __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SEG17_bit           _BIT_ACCESS(PORTC,3)
// LCDDATA2<SEG17COM0>
extern volatile __bit                   SEG17COM0           __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 SEG17COM0_bit       _BIT_ACCESS(LCDDATA2,1)
// LCDDATA8<SEG17COM1>
extern volatile __bit                   SEG17COM1           __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 SEG17COM1_bit       _BIT_ACCESS(LCDDATA8,1)
// LCDDATA14<SEG17COM2>
extern volatile __bit                   SEG17COM2           __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 SEG17COM2_bit       _BIT_ACCESS(LCDDATA14,1)
// LCDDATA20<SEG17COM3>
extern volatile __bit                   SEG17COM3           __at(0x7BD1);	// @ (0xF7A * 8 + 1)
#define                                 SEG17COM3_bit       _BIT_ACCESS(LCDDATA20,1)
// PORTA<SEG18>
extern volatile __bit                   SEG18               __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 SEG18_bit           _BIT_ACCESS(PORTA,1)
// LCDDATA2<SEG18COM0>
extern volatile __bit                   SEG18COM0           __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 SEG18COM0_bit       _BIT_ACCESS(LCDDATA2,2)
// LCDDATA8<SEG18COM1>
extern volatile __bit                   SEG18COM1           __at(0x7B72);	// @ (0xF6E * 8 + 2)
#define                                 SEG18COM1_bit       _BIT_ACCESS(LCDDATA8,2)
// LCDDATA14<SEG18COM2>
extern volatile __bit                   SEG18COM2           __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 SEG18COM2_bit       _BIT_ACCESS(LCDDATA14,2)
// LCDDATA20<SEG18COM3>
extern volatile __bit                   SEG18COM3           __at(0x7BD2);	// @ (0xF7A * 8 + 2)
#define                                 SEG18COM3_bit       _BIT_ACCESS(LCDDATA20,2)
// PORTF<SEG19>
extern volatile __bit                   SEG19               __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 SEG19_bit           _BIT_ACCESS(PORTF,1)
// LCDDATA2<SEG19COM0>
extern volatile __bit                   SEG19COM0           __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 SEG19COM0_bit       _BIT_ACCESS(LCDDATA2,3)
// LCDDATA8<SEG19COM1>
extern volatile __bit                   SEG19COM1           __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 SEG19COM1_bit       _BIT_ACCESS(LCDDATA8,3)
// LCDDATA14<SEG19COM2>
extern volatile __bit                   SEG19COM2           __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 SEG19COM2_bit       _BIT_ACCESS(LCDDATA14,3)
// LCDDATA20<SEG19COM3>
extern volatile __bit                   SEG19COM3           __at(0x7BD3);	// @ (0xF7A * 8 + 3)
#define                                 SEG19COM3_bit       _BIT_ACCESS(LCDDATA20,3)
// LCDDATA0<SEG1COM0>
extern volatile __bit                   SEG1COM0            __at(0x7DD9);	// @ (0xFBB * 8 + 1)
#define                                 SEG1COM0_bit        _BIT_ACCESS(LCDDATA0,1)
// LCDDATA6<SEG1COM1>
extern volatile __bit                   SEG1COM1            __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 SEG1COM1_bit        _BIT_ACCESS(LCDDATA6,1)
// LCDDATA12<SEG1COM2>
extern volatile __bit                   SEG1COM2            __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 SEG1COM2_bit        _BIT_ACCESS(LCDDATA12,1)
// LCDDATA18<SEG1COM3>
extern volatile __bit                   SEG1COM3            __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 SEG1COM3_bit        _BIT_ACCESS(LCDDATA18,1)
// PORTD<SEG2>
extern volatile __bit                   SEG2                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 SEG2_bit            _BIT_ACCESS(PORTD,2)
// PORTF<SEG20>
extern volatile __bit                   SEG20               __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 SEG20_bit           _BIT_ACCESS(PORTF,2)
// LCDDATA2<SEG20COM0>
extern volatile __bit                   SEG20COM0           __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 SEG20COM0_bit       _BIT_ACCESS(LCDDATA2,4)
// LCDDATA8<SEG20COM1>
extern volatile __bit                   SEG20COM1           __at(0x7B74);	// @ (0xF6E * 8 + 4)
#define                                 SEG20COM1_bit       _BIT_ACCESS(LCDDATA8,4)
// LCDDATA14<SEG20COM2>
extern volatile __bit                   SEG20COM2           __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 SEG20COM2_bit       _BIT_ACCESS(LCDDATA14,4)
// LCDDATA20<SEG20COM3>
extern volatile __bit                   SEG20COM3           __at(0x7BD4);	// @ (0xF7A * 8 + 4)
#define                                 SEG20COM3_bit       _BIT_ACCESS(LCDDATA20,4)
// PORTF<SEG21>
extern volatile __bit                   SEG21               __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 SEG21_bit           _BIT_ACCESS(PORTF,3)
// LCDDATA2<SEG21COM0>
extern volatile __bit                   SEG21COM0           __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 SEG21COM0_bit       _BIT_ACCESS(LCDDATA2,5)
// LCDDATA8<SEG21COM1>
extern volatile __bit                   SEG21COM1           __at(0x7B75);	// @ (0xF6E * 8 + 5)
#define                                 SEG21COM1_bit       _BIT_ACCESS(LCDDATA8,5)
// LCDDATA14<SEG21COM2>
extern volatile __bit                   SEG21COM2           __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 SEG21COM2_bit       _BIT_ACCESS(LCDDATA14,5)
// LCDDATA20<SEG21COM3>
extern volatile __bit                   SEG21COM3           __at(0x7BD5);	// @ (0xF7A * 8 + 5)
#define                                 SEG21COM3_bit       _BIT_ACCESS(LCDDATA20,5)
// PORTF<SEG22>
extern volatile __bit                   SEG22               __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 SEG22_bit           _BIT_ACCESS(PORTF,4)
// LCDDATA2<SEG22COM0>
extern volatile __bit                   SEG22COM0           __at(0x7DEE);	// @ (0xFBD * 8 + 6)
#define                                 SEG22COM0_bit       _BIT_ACCESS(LCDDATA2,6)
// LCDDATA8<SEG22COM1>
extern volatile __bit                   SEG22COM1           __at(0x7B76);	// @ (0xF6E * 8 + 6)
#define                                 SEG22COM1_bit       _BIT_ACCESS(LCDDATA8,6)
// LCDDATA14<SEG22COM2>
extern volatile __bit                   SEG22COM2           __at(0x7BA6);	// @ (0xF74 * 8 + 6)
#define                                 SEG22COM2_bit       _BIT_ACCESS(LCDDATA14,6)
// LCDDATA20<SEG22COM3>
extern volatile __bit                   SEG22COM3           __at(0x7BD6);	// @ (0xF7A * 8 + 6)
#define                                 SEG22COM3_bit       _BIT_ACCESS(LCDDATA20,6)
// PORTF<SEG23>
extern volatile __bit                   SEG23               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 SEG23_bit           _BIT_ACCESS(PORTF,5)
// LCDDATA2<SEG23COM0>
extern volatile __bit                   SEG23COM0           __at(0x7DEF);	// @ (0xFBD * 8 + 7)
#define                                 SEG23COM0_bit       _BIT_ACCESS(LCDDATA2,7)
// LCDDATA8<SEG23COM1>
extern volatile __bit                   SEG23COM1           __at(0x7B77);	// @ (0xF6E * 8 + 7)
#define                                 SEG23COM1_bit       _BIT_ACCESS(LCDDATA8,7)
// LCDDATA14<SEG23COM2>
extern volatile __bit                   SEG23COM2           __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 SEG23COM2_bit       _BIT_ACCESS(LCDDATA14,7)
// LCDDATA20<SEG23COM3>
extern volatile __bit                   SEG23COM3           __at(0x7BD7);	// @ (0xF7A * 8 + 7)
#define                                 SEG23COM3_bit       _BIT_ACCESS(LCDDATA20,7)
// PORTF<SEG24>
extern volatile __bit                   SEG24               __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 SEG24_bit           _BIT_ACCESS(PORTF,6)
// LCDDATA3<SEG24COM0>
extern volatile __bit                   SEG24COM0           __at(0x7DF0);	// @ (0xFBE * 8 + 0)
#define                                 SEG24COM0_bit       _BIT_ACCESS(LCDDATA3,0)
// LCDDATA9<SEG24COM1>
extern volatile __bit                   SEG24COM1           __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 SEG24COM1_bit       _BIT_ACCESS(LCDDATA9,0)
// LCDDATA15<SEG24COM2>
extern volatile __bit                   SEG24COM2           __at(0x7BA8);	// @ (0xF75 * 8 + 0)
#define                                 SEG24COM2_bit       _BIT_ACCESS(LCDDATA15,0)
// LCDDATA21<SEG24COM3>
extern volatile __bit                   SEG24COM3           __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 SEG24COM3_bit       _BIT_ACCESS(LCDDATA21,0)
// PORTF<SEG25>
extern volatile __bit                   SEG25               __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 SEG25_bit           _BIT_ACCESS(PORTF,7)
// LCDDATA3<SEG25COM0>
extern volatile __bit                   SEG25COM0           __at(0x7DF1);	// @ (0xFBE * 8 + 1)
#define                                 SEG25COM0_bit       _BIT_ACCESS(LCDDATA3,1)
// LCDDATA9<SEG25COM1>
extern volatile __bit                   SEG25COM1           __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 SEG25COM1_bit       _BIT_ACCESS(LCDDATA9,1)
// LCDDATA15<SEG25COM2>
extern volatile __bit                   SEG25COM2           __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 SEG25COM2_bit       _BIT_ACCESS(LCDDATA15,1)
// LCDDATA21<SEG25COM3>
extern volatile __bit                   SEG25COM3           __at(0x7BD9);	// @ (0xF7B * 8 + 1)
#define                                 SEG25COM3_bit       _BIT_ACCESS(LCDDATA21,1)
// PORTG<SEG26>
extern volatile __bit                   SEG26               __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 SEG26_bit           _BIT_ACCESS(PORTG,4)
// LCDDATA3<SEG26COM0>
extern volatile __bit                   SEG26COM0           __at(0x7DF2);	// @ (0xFBE * 8 + 2)
#define                                 SEG26COM0_bit       _BIT_ACCESS(LCDDATA3,2)
// LCDDATA9<SEG26COM1>
extern volatile __bit                   SEG26COM1           __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 SEG26COM1_bit       _BIT_ACCESS(LCDDATA9,2)
// LCDDATA15<SEG26COM2>
extern volatile __bit                   SEG26COM2           __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 SEG26COM2_bit       _BIT_ACCESS(LCDDATA15,2)
// LCDDATA21<SEG26COM3>
extern volatile __bit                   SEG26COM3           __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 SEG26COM3_bit       _BIT_ACCESS(LCDDATA21,2)
// PORTC<SEG27>
extern volatile __bit                   SEG27               __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 SEG27_bit           _BIT_ACCESS(PORTC,6)
// LCDDATA3<SEG27COM0>
extern volatile __bit                   SEG27COM0           __at(0x7DF3);	// @ (0xFBE * 8 + 3)
#define                                 SEG27COM0_bit       _BIT_ACCESS(LCDDATA3,3)
// LCDDATA9<SEG27COM1>
extern volatile __bit                   SEG27COM1           __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 SEG27COM1_bit       _BIT_ACCESS(LCDDATA9,3)
// LCDDATA15<SEG27COM2>
extern volatile __bit                   SEG27COM2           __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 SEG27COM2_bit       _BIT_ACCESS(LCDDATA15,3)
// LCDDATA21<SEG27COM3>
extern volatile __bit                   SEG27COM3           __at(0x7BDB);	// @ (0xF7B * 8 + 3)
#define                                 SEG27COM3_bit       _BIT_ACCESS(LCDDATA21,3)
// PORTC<SEG28>
extern volatile __bit                   SEG28               __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 SEG28_bit           _BIT_ACCESS(PORTC,7)
// LCDDATA3<SEG28COM0>
extern volatile __bit                   SEG28COM0           __at(0x7DF4);	// @ (0xFBE * 8 + 4)
#define                                 SEG28COM0_bit       _BIT_ACCESS(LCDDATA3,4)
// LCDDATA9<SEG28COM1>
extern volatile __bit                   SEG28COM1           __at(0x7B7C);	// @ (0xF6F * 8 + 4)
#define                                 SEG28COM1_bit       _BIT_ACCESS(LCDDATA9,4)
// LCDDATA15<SEG28COM2>
extern volatile __bit                   SEG28COM2           __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 SEG28COM2_bit       _BIT_ACCESS(LCDDATA15,4)
// LCDDATA21<SEG28COM3>
extern volatile __bit                   SEG28COM3           __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 SEG28COM3_bit       _BIT_ACCESS(LCDDATA21,4)
// PORTB<SEG29>
extern volatile __bit                   SEG29               __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 SEG29_bit           _BIT_ACCESS(PORTB,5)
// LCDDATA3<SEG29COM0>
extern volatile __bit                   SEG29COM0           __at(0x7DF5);	// @ (0xFBE * 8 + 5)
#define                                 SEG29COM0_bit       _BIT_ACCESS(LCDDATA3,5)
// LCDDATA9<SEG29COM1>
extern volatile __bit                   SEG29COM1           __at(0x7B7D);	// @ (0xF6F * 8 + 5)
#define                                 SEG29COM1_bit       _BIT_ACCESS(LCDDATA9,5)
// LCDDATA15<SEG29COM2>
extern volatile __bit                   SEG29COM2           __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 SEG29COM2_bit       _BIT_ACCESS(LCDDATA15,5)
// LCDDATA21<SEG29COM3>
extern volatile __bit                   SEG29COM3           __at(0x7BDD);	// @ (0xF7B * 8 + 5)
#define                                 SEG29COM3_bit       _BIT_ACCESS(LCDDATA21,5)
// LCDDATA0<SEG2COM0>
extern volatile __bit                   SEG2COM0            __at(0x7DDA);	// @ (0xFBB * 8 + 2)
#define                                 SEG2COM0_bit        _BIT_ACCESS(LCDDATA0,2)
// LCDDATA6<SEG2COM1>
extern volatile __bit                   SEG2COM1            __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 SEG2COM1_bit        _BIT_ACCESS(LCDDATA6,2)
